//Задание 1
// Необходимо создать класс Растений
// - Растение может состоять из 2 частей если оно будет кустом(ветки и листья)
// и из 3х частей если оно будет деревом(ствол, ветки и листья)
// - Части растений нужно реализовать как один класс.
// - Так как число частей разное в зависимости от типа то перечень частей можно хранить 
// либо в указателях либо в массиве частей
// 
// Для демонстрации работоспособности растения реализуйте метод вывода описания
// если компоненты класса будут хранится с помощью динамической памяти то необходимо
// реализовать конструкторы копирования и переноса а так же операторы присваивания
// копированием и переносом
//

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}